tap "fujiwara/tap"
tap "go-task/tap"
# CLI for Amazon ECS to manage clusters and tasks for development
brew "amazon-ecs-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Command-line tool for working with AWS CloudFormation
brew "rain"
# Flexible and fast Zsh plugin manager
brew "zinit"
# UNIX shell (command interpreter)
brew "zsh"
# ECS Task Assistant tool.
brew "fujiwara/tap/ecsta"
# ECS task event/log tracer CLI
brew "fujiwara/tap/tracer"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# API development platform
cask "apidog"
# Chromium based browser
cask "arc"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# Desktop password and login vault
cask "bitwarden"
# Anthropic's official Claude AI desktop app
cask "claude"
cask "cmd-eikana"
# Voice and text chat software
cask "discord"
# Multi-platform multi-messaging app
cask "ferdium"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Client for the Google Drive storage service
cask "google-drive"
# Japanese input software
cask "google-japanese-ime"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Browser for ambitious developers
cask "polypane"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Open-source code editor
cask "visual-studio-code"
# Terminal emulator
cask "wave"
# Video communication and virtual meeting platform
cask "zoom"
vscode "arjun.swagger-viewer"
vscode "redhat.vscode-yaml"
